// מהות טיפול חודשי
var arrSubjectDriverMonth = ["לוחות מיגון", "גלגלי מרכוב", "זחלים", "גלגלי תמך, מתח ומרכוב", "הינע", "גלגל מניע וזרים", "משכך זעזועים", "פגושים ותומכי פגוש",
"מנגנון מתח", "בורגי מתיחת זחל", "מנגנון מתיחה הידרואלי", "ניקוי", "צלב אוניברסלי", "ניקוי", "בורגי מקבע ממסרת", "כסא לוחם", "רשתות זיווד", "התקני תחמושת",
"תאורת פנים", "ברז ושתייה", "ריצפת תא לוחמים", "התקן פנימי לאלונקה", "ריהוט והתקנים לנשק", "תחמושת", "כנפיים", "התקני תאי זיווד", "סיפון", "רשתות כונסי אוויר",
"דלת טיפולים", "פתחי שרות בגחון", "ווי גרירה", "תא טלפון אחורי", "מיכל מי שתייה", "תאי מצברים, מכסים ומצברים", "שקע התנעה", "כסא נהג", "מערכת הגה",
"ידית הילוכים", "דוושת מאיץ", "בלם", "בלם חניה", "מחוון דלק", "מסנן אוויר", "פריסקופ", "מצלמת הילה", "מצלמת טופז", "לוח נהג", "זיווד", "מערך מצלמות",
"מערכת תומכת חיים"];
var arrSubjectCommanderMonth = ["מנוע", "ממסרת", "כסא מפקד", "דלת כבש", "מטפים מטלטלים", "כנת מקלע מפקד", "מדף מפקד", "מערכת כיבוי אש תא לוחמים", "עשן מיידי",
"מקלעים", "מרגמה", "חופת חלונות", "מצלמות/ צג", 'מערכת שו"ב', "GPS", "קשר", "בדיקה ויזואלית", "הפעלת המערכת", "בדיקות תפעוליות", "בקר"];
var arrSubjectGunnerMonth = ["כסא מקלען", "מדף מקלען", "פעולות מקדימות", "בדיקה חיצונית", "בדיקה תפעולית יבשה " , "בדיקה פנימית" , "בדיקת תקינות עליית מערכת" , "בדיקות תנועת מערכת" , "נצרת ירי, דריכה ועקיפה" , "בקר מפקד (בנמר שיש בקר)" , "פריסקופ" , "אמצעי תצפית" , "מקלעים" , "תחמושת" , "ניקוי חיצוני"];
// שיטת הביצוע חודשי
var arrExecutaionDriverMonth = [" 1) הסר מהנמר את לוחות המיגון לצורך בחינה (על-פי הוראות בוחן) <br>  2) בדוק סמך התליה וודא חיבור והידוק לקפיץ העלה והידוקן לדופן <br> 3) הדק את בורגי חיבור קפיצי לוחות המיגון לתובה ובורגי חיבור הלוחות לתמכים <br> 4) ודא תקינות וחיבור השרשראות האוחזות בין הפלטות (כולל פלטה ראשונה ואחרונה לתובה)<br>5) התקן את פלטות הבזוקה לנמר בגמר הטיפול " , 'הדק את אומי גלגלי המרכוב במומנט של 52 קג"מ (376 ליברה או פייט)' , '1) בצע מתיחת זחלים בהתאם לצורך <br> 2) ודא הימצאות, טבעות אבטחה משני צדדים ובדוק פיני זחל <br> 3) החלף חוליות זחל פסולות על-פי קביעת הבוחן' , 'ודא שאין נזילות שמן ממחזירי השמן והטבורים. <b>דווח</b> לחוליה על כל נזילה' , 'בדוק את מפלס השמן' , '1) בדוק הידוק הזרים <br> 2) בדוק את אומי תוף גלגל מניע' ,
'1) ודא שהבוכנה בחוץ <br> 2) ודא שהפגוש מהודק לתמך',
'1) סוך במשחה 040 עד גלישת המשחה מפיטמת הפריקה <br> 2) סוך במשחת סיכה 040 את אומי בורגי המתח',
'1) הסר את החול שהצטבר והתקשה בין ראש בורג העין לבסיס מנגנון המתח <br> 2) סוך את אומי המתיחה במשחה 040 עד גלישת המשחה',
'וודא תקינות מנגנון מתיחת זחל, מתיחה ושחרור', 
'1) נקה את המזקו"ם (במידת האפשר) <br> 2) הסר גופים זרים מהמזקו"ם <br> 3) נקה את פנים הנמר <b>חל איסור לשטוף את פנים הנמר במים זורמים </b> <br> 4) נקה את כל משטחי האטימה של דלת הכבש והמדפים ' , 
'סוך את פטמות הסיכה את גלישת המשחה ' , 'נקה את החט"כ דרך דלת טיפולים ממסרת הילוכים' , 
'הדק את בורגי המקבעים במומנט של 52 קג"מ (376 ליברה או פייט), 40 קג"מ (289 ליברה או פייט) בנמר נמר 1500',
'1) נקה ושמן בתרסיס מונע חלודה את מנגנון פתיחת משענת הכסא <br> 2) ודא כי מנגנון המשענת נפתח ונסגר <br> 3) נקה ושמן בתרסיס מונע חלודה את מנגנון פתיחת מושב הכסא <br> 4) ודא כי מנגנון נעילת חגורות הבטיחות נתפס ומשתחרר <br> 5) ודא כי רצועות האבטחה שלמות <br> 6) ודא כי הדום הכסא נסגר לאחר שחררו <br> 7) ודא כי ריפודי הכסא והמשענת אינם קרועים' , 
'1) ודא שלמות הרשתות וחיבורם להתקנים <br> 2) ודא תקינות ושלמות טבעות נעילת הרשתות' ,
'1) ודא תקינות ושלמות התקני התחמושת <br> 2) נקה את בסיסי התקני התחמושת' , 
'וודא תקינות התאורה (לבנה וכחולה), שלימות הפנסים ותקינות עמעמי תאורת פנים' , 
'בדוק יציאת מים מברזי השתיה ימין ושמאל במידה שאין יציאה של מים מהברזים הוסף כנדרש' ,
'1) פתח את ארחי רצפה צפה במרכז תא לוחמים ונקה את הרצפה מחול, קליעים וכו <br> 2) ודא את תקינות ושלמות הרצפה' ,
'1) בדוק את שלמות המוטות <br> 2) שמן את מנגנון התקן האלונקה ודא תנועה חלקה של הסגר ' , 
'בדוק תקינות ושלמות ההתקנים' ,
'ארגן השלם וסדר את התחמושת בהתקנים' ,
'בדוק את תקינות ושלמות הכנפיים' ,
'1) בדוק את תקינות ושלמות התקני הזיווד <br> 2) נקה את תאי הזיווד<br>3) סוך בשמן 9105 את ידיות וצירים <br> 4) ודא כי התאים סגורים ומאובטחים' ,
'הדק את בורגי הסיפון במומנט של 52 קג"מ (376 ליברה או פייט)', 
'נקה את רשתות כונסי אוויר הסר גופים זרים וודא הידוק בורגי הרשתות',
'סוך את פטמות הסיכה של זרועות הדלת ויית נעילה במשחת סיכה 040' ,
'1) ודא שאין נזילות במידה וקיימים משקעים נקז אותם מהתובה <br> 2) בדוק שלמות מכסים השלם והדק ברגים',
'1) נקה וסוך בשמן 9430 את פיני ווי הגרירה והתותבים <br> 2) אבטח את פיני ווי הגרירה' , 
'נקה את תא הטלפון אחורי וסוך צירים בשמן 9430' ,
'וודא נקיון פתח מילוי המים החלף למי שתיה טרים במיכל' ,
'1) בדוק משקעים בתא המצברים ונקז לפי הצורך <br> 2) בצע ניקוי של מנגנון נעילת הדלתות <br> 3) נקה את משטחי האטימה של הדלתות <br> 4) סוך את מנגנוני נעילת הדלתות בשכבה דקה של שמן 9430 <br> 5) ודא שהמכסים של תאי המצברים סגורים כראוי והנועלים במצב סגור בסיום הטיפול <br> 6) ודא שתעלות ניקוז המימן ופתחי האיוורור פתוחים ונקיים <br> 7) נקה את המצברים נעלי הקוטב הכבלים כיסוי הגומי והתאים<b>אין למרוח על הקטבים גריז או ווזלין אין לפתוח פקקים למילוי מים </b>' ,
'בדוק שקעי התנעה או סער' ,
'1) נקה ושמן בתרסיס מונע חלודה את צירי מסלול המושב במצב אופקי ואנכי <br> 2) ודא נעילה ותפקוד הכיסא בכל המצבים: למעלה, קדימה ואחורה (למשענת הגב)' ,
'1) נקה וסוך את ניצרת הגה בשמן <br> 2) גרז את מהפך מנוף היגוי' , 
'1) סוך את מוט הסיכה בציר ידית ההילוכים במשחת סיכה 040 <b> 4 פטמות סיכה (אחת בתא הנהג שלוש בתא חט"כ) </b> <br> 2) שמן את המנגנון בתרסיס מונע חלודה ודא מעבר של הידית בכל המצבים' ,
'1) סוך את מיסב קצה המוט בשמן 9430 <br> 2) סוך במשחת סיכה 040 את מהפך מערכת מאיץ אחורי בתא נהג <br> 3) וודא תנועה חלקה ללא מעצורים <br> 4) נקה את אזור דוושת המאיץ ',
'1) ודא לחץ בלם תקין של P.S.I 2000 בשעון לחץ ובמסך חט"כ. ודא שנורית בלם דולקת במסך חט"כ. <b>אין לעלות מעל P.S.I 2200 בלחיצת הבלם.</b> <br> 2) ודא תקינות בלם והידלקות לחץ תקין לחניה בצג <br> 3) בדוק את מהלך שחיקת הבלמים 14-16 יחידות ובדוק שבמצב בלם לחוץ מהלך הרפידות קטן מ55 יחידות (גדול מ-55 דווח לחוליה) <br> בדוק את מהלך שחיקת הבלמים 20-25 יחידות ובדוק שבמצב בלם לחוץ מהלך הרפידות קטן מ75 (גדול מ-75 דווח לחוליה) <br> 5) ודא לחיצת בלם, שנוריות דולקות בצבע ירוק (בצג מחווני נהג ובלוח מתגי נהג) <br> 6) בדוק את כמות הנוזל במיכל המלאי. בכל מקרה של חוסר בנוזל, יש לבדוק שאין נזילות ממערכת הבלם ולדווח לחוליה <br> 7) בדוק חיווי נורית <b> בלם נהיגה </b> להמצאות חול בתא חת"כ' ,
'1) ודא נעילת בלם החניה ושחררו, בלום בסוף <br> 2) בדוק בצג מחווני נהג, האם הנורית דולקת בעת משיכת בלם החנייה <br> 3) נקה וסוך בשכבה דקה את מסלול הידית <br> 4) בדוק סימון "p" ביתו"ש נהג במשיכה וכיבוי בעת שיחרור בלם <br> 5) סוך פיטמת ציר ידית בלם חניה (בתא נהג) במשחת סיכה 040',
'הפעל את צג מחווני נהג ובדוק את תקינות המחוון' ,
'בדוק תקינות מסנן האוויר בצג מחווני נהג ' ,
'1) בדוק את תקינות הפריסקופים של הנהג <br> 2) בדוק הימצאות מסנן שמש בפריסקופ נהג מרכזי <br> 3) בדוק הימצאות מגן פריסקופים, ודא שניתן לפתוח ולסגור את המגן ושהקפיץ תקין <br> 4) בדוק תקינות אטמי הפריסקופים, החלף אטמים פגומים <br> 1) הדלק את מצלמת ההילה (גל"ם) וודא קבלת תמונה בצג נהג <br> 2) ודא שינוי קוטביות הגל"ם חם=שחור או חם=לבן <br> 3) בדוק שינוי שדה ראייה <br> 4) בדוק שינוי הגבר ועוצמה ידני או אוטו <br> 5) וודא תקינות מסך גל"מ גיבוי <br> 6) וודא קבלת תמונה בצג וידאו נהג <br> 7) בדוק את מנגנון הצידוד של מצלמת הילה וודא שניתן לצודד מצלמה 19 מעלות שמאלה ו58 ימינה <br> 8) בדוק תקינות ושלמות צג וידאו נהג, ודא כי כלל הלחצנים פועלים <br> 9) ודא הופעת סימון זחלים בצג ודידאו נהג ',
'1) הדלק את מצלמת ההילה וודא קבלת תמונה בצג נהג <br> 2) ודא שינוי קוטביות בהילה חם=שחור או חם=לבן <br> בדוק שינוי שדה ראייה <br> 4) בדוק שינוי הגבר ועוצמה ידני או אוטו <br> 5) וודא קבלת תמונת יום ממצלמת טופז על גבי הצג ',
'1) בדוק שמתג בקרת דלק במצב אוטומטי <br> 2) בדוק תקינות צג שוהם ',
'1) הוצא את זיווד הנמר פרוס על יריעת ברזנט ונקה <br> 2) בדוק והחלף זיווד פגום <br> 3) בדוק התקני הזיווד וודא שכל הזיווד מותקן בהתקנים בתום טיפול' ,
'ודא סימון זחלים במצלמה לאחור',
'1) בצע טיפול יומי <br> 2) פתח את דלת טיפולים נקה סביב מדיד השמן וסביב פתח המילוי <br> 3) בדוק שמן במנוע מערכת תומכת חיים (ודא שהשמן בין קו המינימום למקסימום <b> המידה וחסר שמן דווח לחימוש </b> ) <br> 4) בדוק בראייה את מפלס המים דרך הקירות השקופים בשלושת מיכלי המים. ודא שמפלס המים כחצי מגובה המיכל <b> המידה וחסר מים דווח לחימוש </b> <br> 5) בצע שטיפת מעבים <br> 6) בצע התנעה של המערכת ובדוק נוריות תקלה בלוח הפעלה אחורי <b>(במידה ונוריות דולקות דווח לחימוש) </b>ויציאות אוויר ממפוח פינוי אבק (דומם את המנוע להמשך בדיקה) <br> 7) בצע בדיקת על לחץ <br> 8) סגור את דלת הטיפולים וודא שהיא נעולה כראוי <br> 9) בצע הפעלת המערכת מתר נהג ' ];
var arrExecutaionCommanderMonth = ['1) בצע טיפול יומי <br> 2) נקה את פתחי מילוי ובדיקת שמן <br> 3) בדוק את מפלס שמן המנוע לפני הנעה בנמר נמר ו-2 ובהנעה בנמר נמר, הוסף במידת הצורך' ,
'1) נקה את פתח מילוי שמן ממסרת <br> 2) בדוק את מפלס שמן ממסרת לפני הנעה בנמר נמר-2 ובהנעה בנמר נמר , הוסף במידת הצורך',
'1) גרז שתי פטמות בצירי הובלת כסא מפקד <br> 2) נקה ושמן בתרסיס מונע חלודה את מנגנון פתיחת משענת כסא <br> 3) ודא נעילה ותפוד הכסא בכל המצבים <br> 4) ודא כי מנגנון המשענת נפתח ונסגר <br> 5) ודא כי מנגנון נעילת חגורת הבטיחות נתפס ומשתחרר <br> 6) ודא כי רצועות הבטיחות שלמות <br> 7) ודא כי הדום הכסא נסגר לאחר שחררו <br> 8) ודא כי ריפודי הכסא והמשענת אינם קרועים ',
'1) גרז את פיטמות קפיץ הפיתול, צירי הדלת והבריחים במשחת סיכה 040 עד גלישת המשחה <br> 2) ודא את תקינות אטם דלת הכבש <br> 3) ודא תנועה חופשית של דלתית החלון האחורית לסגירה ופתיחה <br> 4) ודא תקינות חרך הירי, בדוק שאין סדקים <br> 5) ודא שקיים פקק ופין להתקן נשק <br> 6) ודא כי דלת חירום ננעלת כראוי (פתח וסגור את הדלת) <br> 7) ודא הימצאות ידיתפתיחה דלת כבש על גבי דלת הכבש ' ,
'1) בדוק הימצאות המטפים במקומם <br> 2) ודא הימצאות פלומבה אבטחה ',
'1) ודא תקינות תפעול במצבים שונים <br> 2) ודא תקינות התקן ארגז פעולה <br> 3) נקה וסוך בריחים וצירים בשמן 9430. ודא תפעול ותנועה ללא מעצורים ובדוק שהמקלע נמצא ונעול על-ידי פינים ',
'1) נקה וסוך במשחת ביכה 040 את ציר המדפים <br> 2) נקה את האטמים ובדוק תפעול תקין של המדף ונעילה בכל המצבים ',
'1) נקה את עדשות הגלאים <br> 2) בהרמת מתג 24 בדוק במודול כיבוי אש שנוריות מיכלים מהבהבות בצבע אדום ולאחר מכן כבויות ונורית מודול דולקת בירוק',
'1) ודא שלמות ותקינות מערכת שיגור <br> 2) ודא שלמות ותקינות כיסוי המשגרים ',
'1) בצע בדיקה ובדוק שהמקלעים (מפקד, מיקלען) פרוקים מתחמושת <br> 2) בדוק שהמקלע נקי ובמקרה של מק"כ, בצע תיאום קנה ונקירה ',
'ודא תקינות סגר המסע',
'1) בדוק תצפית דרך החלונות, שבמדף מפקד <br> 2) בדוק הימצאות מגני יציאת אור ',
'1) ודא שניתן להציג את הוידאו , שמוצג בקטלנית בצג מפקד <br> 2) ודא תקינות צג המפקד, ודא שניתן להציג וידאו מהמצלמות בצג <br> 3) בדוק תקינות התקני צג מפקד ומקלען <br> 4) בדוק שניתן להציג את כל המצלמות ההיקפיות (6 מצלמות) בכל אחד מהצגים, גם תמונות יום ולילה' ,
'1) בדוק תקינות ושלמות צג מחשב הטקטי <br> 2) נקה את הצג באמצעות ספרי לניקוי מסכים <br> 3) הפעל מערכת השו"ב וודא כי המערכת עולה ',
'1) ודא תקינות ושלמות של אנטנת הgps וודא כי האנטנה מהודקת לתובת הנמר <br> 2) הפעל את המחשב הטקטי, וודא כי מערכת הgps פועלת',
'1) בצע טיפול וניקיון במכשירי הקשר <br> 2) בצע בדיקת קשר פנים וחוץ <br> 3) בדוק את תקינות הפתילים והחיבורים',
'1) בדוק שלמות חיצונית וניקיון של מכללי המערכת: פה"מ, אנטנות, מגני צוות, משגרים, מטענים, מכסי ראש, מקבעים, רתמות (ניקיון של המכללים יבוצע על ידי מברשת שערות רכות בלבד) <br> 2) ודא שמכללי המערכת מקובעים היטב למקומם, ודא ניקיון 4 האנטנות <br> 3) ודא שמותקנים ראשים על גבי המשגרים (אין להשאיר משגר ללא ראש) <br> 4) ודא העדר פגיעות מכניות במכללי המערכת (אם מתגלה או משהו חריג יש לדווח לחוליה)',
'1) הפעל את המערכת בדוק תקינות נוריות וסיום אתחול תקין <br> 2) בדוק אייקון מעיל רוח בצג, ודא גזרות סריקה והגנה תקינות (במערכת עם ראשי דמי הגנה תצבע בלבן) <br> 3) בדוק מסך מעיל רוח בשאו"ן, ודא תקינות מרכיבי המערכת <br> 4) בדוק תקלות במסך "אחזקת מערכות או מעיל רוח או כל התקלות" מעיל רוח, רשום את מספרי התקלוץ: <br> 5) בצע בדיקה יזומה (IBIT) ודא תקינות ', 
'1) בצע פתיחה וסגירה דרך השאו"ן של מכסי ראש ימין ושמאל <br> 2) הטה את הראשים המותקנים על גבי המשגרים, ודא מהלך חלק ללא הפעלת כח רב לכל צד עד לעצירה מכנית',
'1) בדוק ויזואלית תקינות ושלמות בקר מפקד <br> 2) בדוק תפעולית את רכיבי בקר המפקד: <br> א) <b> בורר שליטה - ודא </b> מעבר שליטה על הקטלנית בין בקר המפקד לבקר המקלען <br> ב) <b> לחיץ מאפייני חוזי-</b> ודא ביצוע זום ופוקוס. לחיצה קצרה (פחות משניה) שינוי קציף של הזום (עבור כוונת היום בלבד) <br> ג) <b> משבת תנועה-ירי </b> לחץ על המשבת וודא כי מתאפשרת תנועה וירי <br> ד) <b> לחיץ ניהוג- </b> ודא תנועה של המערכת (לכל הכיוונים) בעת הפעלת הפקד <br> ה) <b> לחיץ עקיבה- </b> ודא תקינות תהליך עקיבה והפסקת התהליך <br> ו) <b> לחץ מט"ל </b> ודא קבלת טווח בעת לחיצה על טיל מט"ל <br> ז) <b> -סמן </b> ודא תקינות תפעול לחיץ סמן, ודא שניתן להזיז את העמדה תו"כ ביצוע סימון <br> ח) <b> הדק ירי-</b> ודא שמתג "הירי" למטה ובדוק בשורת הסטטוס החווי "אין אישור לירי". בדוק את לחצן ירי בבקר מפקד לאחר הרמת מתג "ירי". ודא שבעת לחיצה על לחצן הירי מתבצעת "פעולת ירי" ובשורת הסטטוס מופיע החיווי "ירי"',
'ודא ביצוע טיפול חודשי למערכות היעודיות ורישומו בהתאם בטפסים המתאימים'];
var arrExecutaionGunnerMonth = ['1) גרז שתי פטמות בצירי הובלת כסא מקלען <br> 2) ודא נעילה ותפקוד הכסא בכל מצבים <br> 3) נקה ושמן בתרסיס מונע חלודה את מנגנון פתיחת משענת הכסא <br> 4) ודא כי מנגנון המשענת נפתח ונסגר <br> 5) ודא כי מנגנון נעילת חגורות בטיחות נתפס ומשתחרר <br> 6) ודא כי רצועות האבטחה שלמות <br> 7) ודא כי הדום הכסא נסגר לאחר שחררו <br> 8) ודא כי ריפודי הכסא והמשענת אינם קרועים',
'1) נקה וסוך במשחת סיכה 040 את ציר המדפים <br> 2) נקה את האטמים ובדוק תפעול תקין של המדף ונעילה בכל המצבים',
'1) הורד את כל המתגים, בצע כיבוי המערכת וודא שהמערכת כבויה <br> 2) ודא שכלי הנשק שבעמדת הנשק פרוק ושרשיר התחמושת מצוי בארגז התחמושת <br> 3) שמן באמצעות מטלית ושמן 9501 את הפינים והמגרעות בכנה <br> 4) נקה את גג הנמר, עליו מותקנת קטלנית, מתרמילים וחוליות ובצע נייקוי של העמדה החיצונית <b> הערה: אין לנקות את העמדה באמצעות מים בלחץ (גרניק), אלא באמצעות לחץ אוויר ומטלית לחה </b> ',
'1) בדוק חזותית את העמדה להיעדר פגמים או חוסרים הנראים לעין <br> 2) בדוק הידוק ברגי המיגון לעמדה. ודא שעל המיגון מותקנת משקולת איזון כנדרש <br> 3) ודא כי העדשות במצלמת היום ובמצלמת הלילה, נקיות משריטות או לכלוך <br> 4) בדוק תקינות ניתוב הרתמות בעמדה <br> 5) בדוק תקינות ושלמות חיישני המדפים <br> 6) בדוק חיבור תקין של כיסויי גישה לבורגי הידוק העמדה לגלוף ("שמלות") <br> 7) ודא שהמקלע נקי ובמקרה של מק"כ ודא שבוצע תיאום קנה ונקירה על-ידי מפקד הנמר או הנשק שהוסמך לכך',
'1) דרוך ידנית את הנשק ודא פעולה תקינה של מנגנון הדריכה <br> 2) בצע ירי עם זרוע ההדקים ובדוק פעולה תקינה <br> 3) בדוק את תקינות מנגנוני שילוב וניתוק המנועים, ודא יכולת הנעת העמדה ידנית <b> לאחר הניתתוק בדוק שילוב מערכת תקין </b> <br> 4)  בדוק את תקינות סגרי המסע (פיני אבטחה) <br> 5) ודא שניתן להכניס ארגזי פעולה להתקן הייעודי (עבור מאג ועבור מק"כ).',
'1) בדוק את תקינות ושלמות תיבות, צג, ידיות ורתמות חשמליות במערכת- הידוק ברגים <br> 2) ודא חיבור חיישני מדפים תקין. ודא חיווי תקין בצג <br> 3) ודא תפקוד תקין של מתגי תאורת הצג: בדוק בהירות, ניגדיות, צבע, תאורת מקשים על-ידי שינוי מצב מתגי "צג+" ו-"צג-" <br> 4) בדוק הצגת מצב כשהעמדה בהגבהה או הנמכה ובזוויות הקציניות, את הזווית המרבית בהגבהה ובהנמכה, בשעה "12" של האיתן. זווית הגבהה מרבית: 60 מעלות (1 מעלות +-). זווית הנמכה מרבית: -14.5 (1 מעלות +-)' ,
'1) הרם מתג "הפעלה" וודא שהנורית בתיבת המתגים קטלנית (WSCP) דולקות בצבע אדום למשך 3 שניות, לאחר מכם בצבע ירוק למשך 2 שניות ולאחר מכן נדלקת הנורית הפעלה בצבע ירוק באופן קבוע. <br>  ודא שניתן לבחור כלי נשק שונים באמצעות הצג. בחר במסך בחירת כמות כדורים, ״ארגז פעולה של 230 כדור״. על העמדה, הרם לשונית חיישן כדור אחרון וודא על הצג קבלת חיווי ״230 כדורים״ בסרגל הסטטוס (העזר באדם נוסף) <br> 3) ודא שניתן להזין כמות כדורים באופן ידני דרך הצג. <br> 4)  ודא קבלת תמונה ממצלמת יום. <br>  5) בדוק שמצלמת יום נדלקת בשדה ראייה ״אמצע״ ושהמצלמה נמצאת במצב ״DVI״ (דרך מסך אחזקה). הערה: נדרש לעדכן מעבר למצב עלייה מהירה דרך מסך טכנאי כדי לעבור לpal לראות שערוץ הגיבוי תקין' ,
'1) הרם את מתג ״אפשור תנועה״ ובדוק את יכולת הכינון במצב ״כח״ ללא לחיצה על ״משבת תנועה״. וודא שאין תנועה. <br> 2)וודא מתג ״אפשור תנועה״ במצב ״כוח״ ובדוק: א. שתי נוריות ״הגבהה וצידוד״ דולקות בצבע ירוק.  ב. יכולת ביצוע כינון בהגבהה ובצידוד.  ג. על הצג מופיע ״צלב רגיל״.  ד. על הצג מופיע טווח קרבי 200 מטר.  ה. אייקון תנועה בצג מופיע בסטטוס ״כח״ בצבע ירוק.  ו. יכולת הכינון במצב ״כח״ בכל הכיוונים.  ז. שאין תנועה ללא לחיצה על ״משבת תנועה״. <br> 3) הורד את מתג ״אפשור תנועה״ ובדוק ששתי נוריות ״הגבהה וצידוד״ כבות, ובשורת סטטוס מופיע החיווי ״תנועה״ באדום. <br> 4) בצע כנונים עדינים ומהירים בצידוד והגבהה במצב ״כח״ וודא:  א. כינון רציף וללא קטיעות.  ב. חיווי נכון בצלמית הגבהה והצידוד כולל מצבי הקצה והאמצע.  ג. חיווי נכון בצלמית על הצג שהמדפים סגורים ומסומנים בצבע לבן. <br> 5) הרם את מתג ״אפשור תנועה״ ו״ייצוב״ (המערכת במצב ״ייצוב״) וודא:  א. שתי נוריות ייצוב ״תיכון והגבהה״ דולקות בצבע ירוק.  ב. אייקון תנועה בצג בסטטוס ״מיוצב״ בצבע ירוק.  ג. על הצג מופיע ״צלב״.  ד. ניתן לבצע כינונים בלחיצה על ״משבת תנועה״ בהגבהה ובצידוד.  ה. יכולת הכינון ללא לחיצה על ״משבת תנועה״ בקר ימין- וודא שאין תנועה. <br> 6)  בדוק את תקינות מתג מגנטי ״ייצוב״ וודא:  א. בהפלת מתג ״אפשור תנועה״ - מתג מגנטי ״ייצוב״ נופל ונוריות צידוד והגבהה כבות.  ב. בהפלת מתג הפעולה של הקטלנית- מתג מגנטי ״ייצוב״ נופל ונוריות צידוד והגבהה כבות. ',
'1) הרם מתג נצרת מפקד ל"גע", בצע דריכה חשמלית וודא: א. נורית "דריכה" מהבהבת בצבע ירוק למשך חמש שניות עד לסיום הדריכה ומתבצעת דריכה חשמלית. ב. על הצג מופיע חיווי סטטוס "אין אישור ירי" ג. במר"כ - מתבצעת דריכה ארוכה (גררה נעצרת בסוף המנגנון). במא"ג - מתבצעת דריכה קצרה. <br> 2) הורד את מתג "הירי" ובדוק את חיווי הירי שעל הצג: בשורת הסטטוס מופיע החיווי "אין אישור לירי" <br> 3) בדוק את תקינות מתג מגנטי "ירי" וודא: א. בהפלת מתג ירי בלוח המפקד - מתג מגנטי "ירי" בתיבת מתגי מקלען נופל והנורית כבית ב. בהפלת מתג פעולה בתיבת מתגי מקלען - מתג מגנטי "ירי" נופל והנורית כבית <br> 4) בדוק את לחצן ירי בקר ימין לאחר הרמת מתג "ירי". וודא שבעת לחיצה על לחצן הירי מתבצעת "פעולת ירי" ובשורת הסטטוס מופיע חיווי "ירי מתבצע" <br> 5) בצע חצי לחיצה על לחצן "ירי" וודא שאין פעולת ירי. <br> 6) וודא שנורית "ירי" דולקת בצבע ירוק, ועל הצג בשורת הסטטוס מופיע החיווי "ירי" <br> 7) הורד מתג "אפשור תנועה" ובדוק את תקינות מתג "ירי" וודא שהירי חסום כולל בשורת הסטטוס ונורית "ירי" מהבהבת בצבע ירוק. <br> 8) דמה תקלת מדפים ובדוק את תקינות פעולת מתג "איסור ירי" (עקיפה). וודא כי לא ניתן לבצע ירי ללא הרמת "איסור ירי" <br> 9) בדוק תקינות שמורת מתג "איסור ירי" וודא שהמתג נופל לאחר סגירת השמורה <b> חזור על הבדיקה 5 פעמים </b> <br> 10) דמה תקלת מדפים במצבים "אפשור תנועה" ו"ייצוב" הרם מתג "איסור ירי" ובדוק: א. נורית "עקיפה" דולקת בצבע אדום ב. לאחר הזזת הקטלנית לגזרת איסור ירי מעל המדפים, וודא שבמצב זה נורית "עקיפה" מהבהבת באדום, ניתן לבצע ירי ועל הצג בשורת הסטטוס מופיע חיווי "עקיפת איסור ירי" ' ,
'1) בדוק ויזואליות תקינות ושלמות בקר המפקד. <br> 2) בדוק תפעולית את רכיבי בקר המפקד:  א. בורר שליטה - ודא מעבר שליטה על הקטלנית בין בקר המפקד לבקר המקלען.  ב. לחיץ מאפייני חוזי - ודא ביצוע זום ופוקוס. לחיצה קצרה (פחות מ-1 שניה)- שינוי שדה ראייה. לחיצה ארוכה (יותר מ-1 שניה)- שינוי רציף של הזום (עבור כוונת יום בלבד).  ג. משבת תנועה-ירי - לחץ על המשבת וודא כי מתאפשרת תנועה וירי.  ד. לחיץ ניהוג - ודא תנועה של המערכת (לכל הכיוונים) בעת הפעלת הפקד.  ה. לחיץ עקיבה - ודא תקינות תהליך עקיבה והפסקת התהליך.  ו. לחיץ מט״ל - ודא קבלת טווח בעת לחיצה על לחיץ מט״ל.  ז. סמן - ודא תקינות תפעול לחיץ סמן, ודא שניתן להזיז את העמדה תו״כ ביצוע סימון.  ח. הדק ירי - ודא שמתג ה״ירי״ למטה ובדוק בשורת הסטטוס החיווי ״אין אישור לירי״. בדוק את לחצן ירי בבקר מפקד לאחר הרמת מתג ״ירי״. ודא שבעת לחיצה על לחצן הירי מתבצעת ״פעולת ירי״, ובשורת הסטטוס מופיע החיווי ״ירי״. ' ,
'1) בדוק את תקינות הפריסקופ של המקלען. <br> 2)  בדוק הימצאות מגן פריסקופים, ודא כי מגן יציאת האור מחובר באמצעות שרשרת. ',
'1)  בדוק ניקיון אופטי ב: פריסקופים, מצלמות היקפיות, מדף חלונות, חלון תצפית אחורי, מצלמת הילה (גל״ם), מצלמות קטלנית. <br> 2)  נקה את האמצעים האופטיים באמצעות מברשת רכה או מטלית לחה. ',
'1) פרק את המקלעים פירוק חייל. <br> 2)  נקה את חלקי המקלע מלכלוך, אבק חלודה או פיח באמצעות תערובת ניקוי. <br> 3) שמן את חלקי המקלע בשמן 9105.  <br> 4) הרכב את חלקי המקלע בהתאם למספרים הטבועים על המקלע והחלקים. <br> 5) טפל בקנים הרזרביים.',
'1) בצע בדיקה ויזואלית של שלמות חיצונית של התחמושת ואריזתה. <br> 2)  ודא ניקיון התחמושת וההתקנים מבוץ, קורוזיה, אבק ורטיבות.  <br> 3) בדוק סגרים וחיזוק התחמושת בתאי האחסון ובהתקנים. <br> 4) ודא כי נרות עשן מס׳ 2 (במידה ויש) עטופים בניילון בהתקנים חיצוניים בתקופת החורף. <br> 5)  ודא כי טבעת נצרה מאובטחת בתוך חבק הבטיחות ברימוני רסס/ עשן. <br> 6)  ודא הימצאות תרמילים ריקים וכדורים זרוקים ברק״מ. ']
// מהות טיפול שבועי 
var arrSubjectDriverWeek = ['מזקו"ם',"גלגלי מרכוב", "זחלים ובורגי מתיחה", "ניקוי פנימי", "בורגי מקבע ממסרת", "כסא לוחם", "ברז שתייה", "התקנים לנשק", "תחמושת", "התקנים ותאי זיווד", "רשתות כונסי אוויר", "פתחי שרות בגחון", "תא טלפון אחורי", "מיכל מי שתייה", "תאי מצברים, מכסים ומצברים", "זיווד", "מערכת תומכת חיים", "כסא נהג", "בלם", "בלם חניה", "מחוון דלק", "פריסקופ", "מצלמת הילה", "מצלמת טופז", "תאורת חוץ", "דלק"];
var arrSubjectCommanderWeek = ["מנוע", "ממסרת", "כסא מפקד", "דלת כבש", "מטפים מטלטלים", "כנת מקלע מפקד", "מדף מפקד", "עשן מיידי", "מערכת כיבוי אש", "חופת חלונות", "מצלמות/ צג", 'מערכת שו"ב', "GPS", "קשר", "מקלעים", "מרגמה", "בדיקה ויזואלית", "הדלקת מערכת", "בדיקה תפעולית", "בקר מפקד (בנמר שיש בקר)", "נמרים ייעודים הנדסה, אחזקה, פיקוד...'", "קשר רדיו", 'שו"ב'];
var arrSubjectGunnerWeek = ["כסא מקלען", "מדף מקלען", "פעולות מקדימות", "בדיקה חיצונית", "בדיקה תפעולית יבשה", "בדיקה פנימית", "בדיקת תקינות הדלקת מערכת", "בדיקת תקינות עליית מערכת", "בדיקת תנועת מערכת", "נצרת ירי, דריכה ועקיפה", "פריסקופ", "אמצעי תצפית", "מקלעים", "תחמושת"];
// שיטת הביצוע שבועי
var arrExecutaionDriverWeek = ['נקה את מזקו"ם הנמר והסר גופים זרים', 'הדק את אומי גלגלי המרכוב במומנט של 52 קג"מ (376 ליברה/ פייט) בעמדה הראשונה', 
'1) בצע מתיחת זחלים בהתאם לצורך. <br> 2) ודא הימצאות, טבעות אבטחה משני הצדדים ובדוק תקינות פיני זחל. <br> 3) החלף חוליות זחל פסולות על פי קביעת הבוחן. <br> 4) ניקוי וטיפול בבורג + באום.',
'נקה את פנים הנמר',
'1) הדק את בורגי המקבעים בממונט של 52 קג"מ (376 ליברה/ פייט), 40 קג"מ (289 ליברה/ פייט) בנמר נמר 1500 <br> 2) ניקוי ממסרת + מוטות שליטה',
'1) ודא כי מנגנון המשענת נפתח ונסגר. <br> 2) ודא כי הדום הכסא נסגר לאחר שחרורו.',
'בדוק יציאת מים מברזי השתייה ימין ושמאל, במידה ואין יציאה של מים מהברזים, הוסף כנדרש',
'בדוק תקינות ושלמות ההתקנים', 'ארגן, השלם וסדר את התחמושת בהתקנים', '1) ודא כי התאים סגורים ומאובטחים', 
'נקה את רשתות כונסי אוויר, הסר גופים זרים וודא הידוק בורגי הרשתות', 'ודא שאין נזילות, במידה וקיימים משקעים נקז אותם מהתובה', 'נקה את תא טלפון אחורי וודא נעילה.',
'ודא ניקיון פתח מילוי המים ומלא מי שתייה במיכל במידת הצורך.',
'1) בצע ניקוי של מנגנון נעילת הדלתות. <br> 2) ודא שהמכסים של תאי המצברים סגורים כראוי והנועלים במצב סגור בסיום הטיפול.',
'1) בדוק והחלף זיווד פגום. <br> 2) בדוק התקני הזיווד וודא שכל הזיווד מותקן בהתקנים בתום הטיפול.',
'1) בצע טיפול יומי <br> 2) פתח את דלת טיפולים, נקה סביב מדיד השמן וסביב פתח המילוי. <br> 3) בדוק שמן במנוע מערכת תומכת חיים (ודא שהשמן בין קו המינימום למקסימום) <b>במידה וחסר שמן דווח לחימוש</b> <br> 4) בדוק בראייה את מפלס מים דרך הקירות השקופים בשלושת מיכלי המים. ודא שמפלס המים כ-1/2 מגובה המיכל. <b>במידה וחסר מים דווח לחימוש</b> <br> 5) סגור את דלת הטיפולים וודא שהיא נעולה כראוי.',
'1) ודא ניקוי ושימון של מסלולי הכסא <br> 2) ודא נעילה ותפקוד הכסא בכל המצבים : למעלה, קדימה ואחורה (למשענת הגב)', '<b>ודא ניקוי אזור דוושת הבלם</b>',
'1)ודא לחץ בלם תקין של P.S.I 2000 בשעון לחץ ובמסך חט"כ. ודא שנורית בלם דולקת במסך חט"כ. <b>אין לעלות מעל P.S.I 2200 בלחיצת הבלם.</b> <br> 2) ודא תקינות בלם והידלקות לחץ תקין לחניה בצג. <br> 3) בצע בדיקת תקינות רפידות בילום (ביחד עם המפקד) : <br> א) בדוק את מהלך רפידות הבלמים 14-16 יחידות. <br> ב) בדוק במצב בלם לחוץ שמהלך הרפידות קטן מ-55 יחידות <br> ג) בדוק את מהלך שחיקת הבלמים 20-25 יחידות ובדוק שבמצב בלם לחוץ מהלך הרפידות קטן מ-75 (גדול מ-75 דווח לחוליה) <br> 4) בדוק תקינות ושלמות שעון לחץ. <br> 5) ודא בלחיצת בלם, שנוריות דולקות בצבע ירוק (בצג מחווני נהג ובלוח מתגי נהג). <br> 6) בדוק את כמות הנוזל במיכל המלאי. בכל מקרה של חוסר בנוזל, יש לבדוק שאין נזילות ממערכת הבלם ולדווח לחוליה.',
'1) ודא נעילת בלם החניה ושחרורו, בלום בסוף. <br> 2) בדוק בצג מחווני נהג, האם הנורית דולקת בעת משיכת בלם החנייה. <br> 3) נקה וסןך בשכבה דקה את מסלול הידית, בשמן 9430.',
'הפעל את צג מחווני נהג ובדוק את תקינות המחוון.',
'1) בדוק את תקינות הפריסקופים של הנהג. <br> 2) בדוק הימצאות מסנן שמש בפריסקופ נהג מרכזי. <br> 3) בדוק הימצאות מגן פריסקופים, ודא שניתן לפתוח ולסגור את המגן, ושהקפיץ תקין',
`1) הדלק את מצלמת ההילה (גל"ם) וודא קבלת תמונה בצג הנהג. <br> 2) ודא שאין קוטביות בגל"ם חם = שחור/ חם - לבן. <br> 3) בדוק שינוי שדה הראייה. <br> 4) בדוק שינוי הגבר ועוצמה ידני/ אוטו' <br> 5) ודא תקינות מסך גל"מ גיבוי. <br> 6) וודא קבלת תמונה בצג וידאו נהג <br> 7) בדוק את מנגנון הצידוד של מצלמת הילה וודא שניתן לצודד את המצלמה 19° שמאלה ו-58° ימינה <br> 8) בדוק תקינות ושלמות צג וידאו נהג, ודא כי כלל הלחצנים פועלים. <br> 9) ודא הופעת סימון זחלים בצג וידאו נהג.`,
`1) הדלק את מצלמת ההילה וודא קבלת תמונה בצג הנהג <br> 2) ודא שינוי קוטביות בהילה חם = שחור /חם = לבן. <br> 3) בדוק שינוי שדה הראייה. <br> 4) בדוק שינוי הגבר ועוצמה ידני/ אוטו' <br> 5) וודא קבלת תמונת יום ממצלמת טופז על גבי הצג.`,
'ודא תקינות התאורה ושלמות הפנסים (בעזרת המפקד)',
'1) נקה את פתחי מילוי הדלק במיכלים <b>(שלושת פתחים).</b> <br> 2) תדלק את מיכלי הדלק עד 10 ס"מ מפתח מילוי.'];
var arrExecutaionCommanderWeek = ['1) בצע טיפול יומי. <br> 2) נקה את פתחי מילוי ובדיקת שמן. <br> 3) בדוק את מפלס שמן המנוע, לפני הנעה בנמר נמר ו-2, ובהנעה בנמר נמר, הוסף במידת הצורך.',
'1) נקה את פתח מילוי שמן ממסרת. <br> 2) בדוק את מפלס שמן ממסרת לפני הנעה בנמר נמר -2, ובהנעה בנמר נמר, הוסף במידת הצורך',
'1) ודא נעילה ותפקוד הכסא בכל המצבים. <br> 2) ודא כי מנגנון המשענת נפתח ונסגר. <br> 3) ודא כי מנגנון נעילת חגורות הבטיחות נתפס ומשתחרר. <br> 4) ודא כי הדום הכסא נסגר לאחר שחרורו.',
'1) ודא תנועה חופשית של המיתקון הייעודי לנשק בתול הבית אשר בדלת חירום. <br> 2) ודא תקינות חרך הירי, בדוק שאין סדקים. <br> 3) ודא שקיים פקק ופין להתקן נשק. <br> 4) וודא הימצאות ידית פתיחת דלת כבש על גבי דלת הכבש.',
'1) בדוק הימצאות המטפים במקומם. <br> 2) ודא הימצאות פלומבה אבטחה.',
'1) ודא תקינות תפעול במצבים השונים. <br> 2) ודא תקינות התקן ראגז בפעולה. <br> 3) נקה וסוך בריחים וצירים בשמן 9430. ודא תפעול ותנועה ללא מעצורים ובדוק שהמקלע נמצא ונעול על ידי פינים.',
'נקה את האטמים, ובדוק תפעול תקין של המדף ונעילה בכל המצבים.',
'1) ודא שלמות ותקינות מערכת השיגור. <br> 2) ודא שלמות ותקינות כיסוי המשגרים.',
'נקה את עדשות הגלאים.',
'1) בדוק תצפית דרך החלונות, שבמדף המפקד. <br> 2) בדוק שלמות חופת חלונות.',
'1) ודא שניתן להציג את הוידאו, שמוצג בקטלנית בצג מפקד. <br> 2) ודא תקינות צג המפקד, ודא שניתן להציג וידאו מהמצלמות בצג. <br> 3) בדוק תקינות התקני צג מפקד ומקלען. <br> 4) בדוק שניתן להציג את כל המצלמות ההיקפיות (6 מצלמות) בכל אחד מהצגים, גם תמונת יום וגם תמונת לילה.',
'1) בדוק תקינות ושלמות צג מחשב הטקטי. <br> 2) נקה את הצג באמצעות ספרי לניקוי מסכים. <br> 3) הפעל את מערכת השו"ב וודא כי המערכת עולה.',
'1) ודא תקינות ושלמות של אנטת ה-GPS וודא כי האנטנה מהודקת לתובת הנמר. <br> 2) הפעל את המחשב הטקטי, וודא כי מערכת ה-GPS פועלת.',
'1) בדוק את שלמות כלל הכובעים והפתילי הלב. <br> 2) נקה את הכובעים וסדר אותם ואת הפתילים. <br> 3) בדוק שמע עצמי ותקינות בכלל הכובעים במצב  קשר פנים ובמצב קשר חוץ.',
'1) בצד בדיקה ובדוק שהמקלעים (מפקד, מיקלען) פרוקים מתחמושת <br> 2) בדוק שהמקלע נקי ובמקרה של מק"כ, בצע תיאום קנה ונקירה.',
'1) ודא הימצאות כיפת לוע. <br> 2) ודא שהמרגמה מותקנת כראוי על התפוח.',
'1) בדוק שלמות חיצונית וניקיון של מכללי המערכת : פה"מ, אנטנות, מגני צוות, משגרים, מטענים, מכסי ראש, מקבעים ורתמות. <br> 2) ודא שמכללי המערכת מקובעים היטב למקומם. <br> 3) בדוק שלימות הספוגים בהיקף הראש. <br> 4) ודא כי מותקנים ראשים על גבי המשגרים. <br> 5) ודא העדר פגיעות מכניות במכללי המערכת.',
'1) הדלק מערכת בדוק תקינות נוריות וסיום איתחול תקין. <br> 2) בדוק אייקון מעיל רוח בשו"ב ודא גזרות סריקה והגנה תקינות. <br> 3) בדוק מסך מעיל רוח בשאו"ן, ודא תקינות מרכיבי המערכת. <br> 4) בדוק תקלות במסך "אחזקת מערכות/ מעיל רוח/ כל התקלות" מעיל רוח, רשום את מספרי התקלות. <br> 5) רשום תקלות מערכתיות',
'1) בצע פתיחה וסגירה של מכסי ראש ימין ושמאל דרך השאו"ן. <br> 2) הטה את הראשים המותקנים ע"ג המשגרים, וודא מהלך חלק ללא הפעלת כח רב לכל צד עד לעצירת מכנית.',
'1) בדוק ויזואלית תקינות ושלמות בקר המפקד. <br> 2) בדוק תפעולית את רכיבי בקר המפקד : <br> א) <b>בורר שליטה - ודא</b> מעבר שליטה על הקטלנית בין בקר המפקד לבקר המקלען. <br> ב) <b>לחיץ מאפייני חוזי - </b> ודא ביצוע זום ופוקוס. <br> לחיצה קצרה (פחות מ-1 שנייה) - שינוי שדה ראייה. <br> לחיצה ארוכה (יותר מ-1 שהנייה) - שינוי רציף של הזום (עבור כוונת יום בלבד). <br> ג) <b>משבת תנועה - ירי</b> לחץ על המשבת וודא כי מתאפשרת תנועה וירי. <br> <b>ד) לחיץ ניהוג -</b> ודא תנועה של המערכת (לכל הכיוונים) בעת הפעלת הפקד. <br> ה) <b> לחיץ עקיבה -</b> ודא תקינות תהליך עקיבה והפסקת התהליך. <br> ו) <b>לחיץ מט"ל -</b> ודא קבלת טווח בעת לחיצה על לחיץ מט"ל. <br> ז) <b>סמן -</b> ודא תקינות תפעול לחיץ סמן, ודא <b>שניתן</b> להזיז את העמדה תו"כ ביצוע סימון. <br> ח) <b>הדק ירי -</b> ודא שמתג "הירי" למטה ובדוק בשורת הסטטוס החיווי "אין אישור לירי". <br> בדוק את לחצן ירי בבקר מפקד לאחר הרמת מתג "ירי". ודא שבעת לחיצה על לחצן הירי מתבצעת "פעולה ירי", ובשורת הסטטוס מופיע החיווי "ירי".',
'ודא ביצוע טיפול שבועי למערכות הייעודיות ורישומו בהתאם בטפסים המתאימים.',
'1) בדוק שלמות כלל האנטנות וחיבורם. <br> 2) בדוק תקינות ושלמות כלל הפתילים וחיבורם למקום. <br> 3) ודא קיבוע מכשיר הקשר למקום. <br> 4) נקה את מכשיר הקשר. <br> 5) עלה לבדיקת קשר מול כלי אחר מרוחק.',
'1) בדוק תקינות ושלמות צג מחשב הטקטי. <br> 2) נקה את הצג באמצעות מטלית יבשה. <br> 3) ודא קיבוע המחשב הטקטי במקומו. <br> 4) בדוק תקינות ושלמות המב"ן וחיבוריו. <br> 5) ודא קיבוע המב"ן למקומו. <br> 6) הפעל את המערכת וודא כי האמצעים נדלקים. <br> 7) ודא תקשורת GPS בצג השו"ב. <br> 8) ודא תקשורת השו"ב עם מערכת התלתן ע"י סימון נמר ירוק בצג השו"ב. <br> 9) ודא תקשורת השו"ב עם המב"ן ע"י סימון מחשב ירוק במסך המב"ן. <br> 10) בדוק קישוריות השו"ב למרחב בעזרת כלי נוסף.'];
var arrExecutaionGunnerWeek = ['1) ודא נעילה ותפקוד הכסא בכל המצבים. <br> 2) ודא כי מנגנון המשענת נפתח ונסגר. <br> 3) ודא כי מנגנון נעילת חגורות הבטיחות נתפס ומשתחרר. <br> 4) ודא כי הדום הכסא נסגר לאחר שחרורו.',
'נקה את האטמים, ובדוק תפעול תקין של המדף ונעילה בכל המצבים.',
'1) הורד את כל המתגים, בצע כיבוי המערכת וודא שהמערכת כבויה. <br> 2) ודא שכלי הנשק שבמעמדת הנשק פרוק ושרשיר התחמושת מצוי בארגז תחמושת. <br> 3) שמן באמצעות מטלית ושמן 9105 את הפינים והמגרעות בכנה. <br> 4) נקה את גג הנמר, עליו מותקנת קטלנית, מתרמילים וחוליות, ובצע ניקוי של העמדה החיצונית. <br> <b>הערה : אין לנקות את העמדה באמצעות מים בלחץ (גרניק), אלא באמצעות לחץ אוויר ומטלית לחה.</b>',
'1) בדוק חזותית את העמדה להיעדר פגמים או חוסרים הנראים לעין. <br> 2) ודא כי העדשות במצלמת היום ובמצלמת הלילה נקיות. <br> 3) ודא שהמקלע נקי ובמקרה של מק"כ ודא שבוצע תיאום קנה ונקירה על ידי מפקד הנמר או נשק שהוסמך לכך. <br> 4) ודא שלמות וניקיון המערכת מחול ואבק.',
'1) הבא את העמדה למיקום חניה. <br> 2) בדוק את תקינות סגרי המסע (פיני אבטחה). <br> 3) ודא תקינות פיני הנשק על גבי העריסה. <br> 4) דרוך ידנית את הנשק ודא פעולה תקינה של מנגנון הדריכה. <br> 5) בצע ירי עם זרוע ההדקים ובדוק פעולה תקינה. <br> 6) ודא שניתן להכניס ארגזי פעולה להתקן הייעודי (עבור מא"ג ועבור מק"כ). <br> 7) בדוק את תקינות מנגנוני שילוב וניתוק המנועים, ודא יכולת הנעת העמדה ידנית. ודא במצב הגבהה מרבית שאין פגיעה במגן הרתמות. <b>לאחר הניתוק בדוק שילוב מערכת תקין.</b>',
`1) בדוק את שלמות תיבות, צג, ידיות. <br> 2) בדוק הצגת מצב כשהעמדה בהגבהה/ הנמכה ובזוויות הקיצוניות, את הזווית המרבית בהגבהה ובהנמכה, בשעה "12" של הנמר. <br>  זווית הגבהה מרבית : 60 (±1°) מעלות. <br> זווית הנמכה מרבית : -14.5 (±1°) מע'`,
'ודא שניתן לבחור כלי נשק שונים באמצעות הצג. בחדר במסך בחירת כמות כדורים, חצי ארגז פעולה. על העמדה, הרם לשונית חיישן כדור אחרון וודא על הצג קבלת חיווי "100 כדורים" בשורת הסטטוס <b>(העזר באדם נוסף)</b>',
'1) הרם את מתג "הפעלה" וודא שהנוריות בתיבת מתגים קטלנית (WSCP), דולקות בצבע אדום למשך 3 שניות, לאחר מכן בצבע ירוק למשך 2 שניות ולאחר מכן נדלקת הנורית הפעלה בצבע ירוק באופן קבוע. <br> 2) ודא שניתן לבחור כלי נשק שונים באמצעות הצג. בחר במסך בחירת כמות כדורים, "ארגז פעולה של 230 כדור". על העמדה, הרם לשונית חיישן כדור אחרון וודא על הצג קבלת חיווי "230 כדורים" בסרגל הסטטוס <b>(העזר באדם נוסף)</b> <br> 3) ודא שניתן להזין כמות כדורים באופן ידני דרך הצג. <br> 4) ודא קבלת תמונה ממצלמת יום. <br> 5) בדוק שמצלמת יום נדלקת בשדה ראייה "אמצע" ושהמצלמה נמצאת במצב "DVI" (דרך מסך האחזקה).',
'1) הרם את מתג "אפשר תנועה". ובדוק את יכולת הכינון במצב "כח" ללא לחיצה על "משבת תנועה". וודא שאין תנועה. <br> 2) ודא מתג "אפשור תנועה" במצב "כוח" ובדוק: <br> א) שתי נוריות "הגבהה וצידוד" דולקות בצבע ירוק. <br> ב) יכולת ביצוע כינון בהגבהה ובצידוד. <br> ג) על הצג מופיע "צלב רגיל" <br> ד) על הצג מופיע טווח קרבי 200 מטר <br> ה) אייקון תנועה בצג מופיע בסטטוס "כח" בצבע ירוק. <br> ו) יכולת הכינון במצב "כח" בכל הכיוונים <br> ז) שאין תנועה ללא לחיצה על "משבת תנועה" <br> 3) הורד את מתג "אפשור תנועה" ובדוק ששתי נוריות "הגבהה וצידוד" כבות, ובשורת סטטוס מופיע החיווי "תנועה" באדום. <br> 4) בצע כנונים עדינים ומהירים בצידוד והגבהה במצב "כח" וודא : <br> א) כינון רציף וללא קטיעות. <br> ב) חיווי נכון בצלמית הגבהה והצידוד כולל מצבי הקצה והאמצע. <br> ג) חיווי נכון בצלמית על הצג. <br> שהמדפים סגורים ומסומנים בצבע לבן. <br> 5) הרם את מתג "אפשור תנועה" ו"ייצוב" (המערכת במצב "ייצוב") וודא: <br> א) שתי נוריות ייצוב "צידוד והגבהה" דולקות בצבע ירוק. <br> ב) אייקון תנועה בצג בסטטוס "מיוצב" בצבע ירוק. <br> ג) על הצג מופיע "צלב". <br> ד) ניתן לבצע כינונים בלחיצה על "משבת תנועה" בהגבהה ובצידוד. <br> ה) יכולת הכינון ללא לחיצה על "משבת תנועה" בקר ימין - ודא שאין תנועה. <br> 6) בדוק את תקינות מתג מגנטי "ייצוב" וודא : <br> א) בהפלת מתג "אפשור תנועה" - מתג מגנטי "ייצוב: נופל ונוריות צידוד והגבהה כבות. <br> ב) בהפלת מתג הפעלה של הקטלנית - מתג מגנטי "ייצוב" נופל ונוריות צידוד והגבהה כבות.',
'1) הרם מתג נצרת מפקד ל"גע", בצע דריכה חשמלית וודא : <br> א) נורית "דריכה" מהבהבת בצבע ירוק למשך 5 שניות עד לסיום הדריכה ומתבצעת דריכה חשמלית. <br> ב) על הצג מופיע חיווי סטטוס "אין אישור ירי". <br> ג) במק"כ - מתבצעת דריכה ארוכה (גרהה נעצרת בסוף המנגנון). במא"ג מתבצעת דריכה קצרה. <br> 2) הורד את מתג "הירי" ובדוק את חיווי הירי שעל הצג : בשורת הסטטוס מופיע החיווי "אין אישור לירי". <br> 3) בדוק את תקינות מתג מגנטי "ירי" וודא : <br> א) בהפלת מתג ירי בלוח המפקד - מתג מגנטי "ירי" בתיבת מתגי מקלען נופל והנורית כבית. <br> ב) בהפלת מתג פעולה בתיבת מתגי מקלען - מתג מגנטי "ירי" נופל והנורית כבית. <br> 4) בדוק את לחצן ירי בקר ימין לאחר הרמת מתג "ירי". וודא שבעת לחיצה על לחצן הירי מתבצעת "פעולת ירי", ובשורת הסטטוס מופיע חיווי "ירי מתבצע". <br> 5) בצע חצי לחיצה על לחצן "ירי" וודא שאין פעולת ירי. <br> 6) וודא שנורית "ירי" דולקת בצבע ירוק, ועל הצג בשורת הסטטוס מופיע החיווי "ירי". <br> 7) הורד מתג "אפשור תנועה" ובדוק את תקינות מתג "ירי", וודא שהירי חסום כולל בשורת הסטטוס ונורית "ירי" מהבהבת בצבע ירוק. <br> 8) דמה תקלת מדפים ובדוק תקינות פעולת מתג "איסור ירי" (עקיפה). וודא כי לא ניתן לבצע ירי ללא הרמת מתג "איסור ירי". <br> 9) בדוק את תקינות שמורת מתג "איסור ירי" וודא שהמתג נופל. לאחר סגירת השמורה. <b>חזור על הבדיקה 5 פעמים.</b> <br> 10) דמה תקלת מדפים במצבים "אפשור תנועה" ו"ייצוב" הרם את מתג "איסור ירי" ובדוק: <br> א) נורית "עקיפה" דולקת בצבע אדום. <br> ב) לאחר הזזת הקטלנית לגזרת איסור ירי מעל המדפים, וודא שבמצב זה נורית "עקיפה" מהבהבת בצבע אדום, ניתן לבצע ירי ועל הצג בשורת הסטטוס מופיע החיווי "עקיפת איסור ירי".',
'1) בדוק את תקינות הפריסקופים של המקלען. <br> 2) בדוק הימצאות מגן פריסקופים, ודא כי מגן יציאת האור מחובר באמצעות שרשרת.',
'1) בדוק ניקיון אופטי ב: פריסקופים, מצלמות היקפיות, מדף חלונות, חלון תצפית אחורי, מצלמת הילה (גל"ם), מצלמות קטלנית. <br> 2) נקה את האמצעים האופטיים באמצעות מברשת רכה או מטלית לחה.',
'1) פרק את המקלעים פירוק חייל. <br> 2) נקה את חלקי המקלע מלכלוך, אבק, חלודה או פיח באמצעות תערובת ניקוי. <br> 3) שמן את חלקי המקלע בשמן 9105. <br> 4) הרכב את חלקי המקלע בהתאם למספרים הטבועים על המקלע והחלקים. <br> 5) טפל בקנים הרזרביים.',
`1) בצע בדיקה ויזואלית של שלמות חיצונית של התחמושת ואריזתה. <br> 2) ודא ניקיון התחמושת וההתקנים מבוץ, קורוזיה, אבק ורטיבות. <br> 3) בדוק סגרים וחיזוק התחמושת בתאי האחסון ובהתקנים. <br> 4) ודא כי נרות עשן מס' 2 (במידה ויש) עטופים בניילון בהתקנים חיצוניים בתקופת החורף. <br> 5) ודא כי טבעת ניצרה מאוטבחת בתוך חבק הבטיחות ברימוני רסס/ עשן. <br> 6) וודא אי הימצאות תרמילים ריקים וכדורים זרוקים ברק"מ.`];

let chosen;
let type;
window.addEventListener("load", () => {
    // window.scrollTo(0, 1);

    document.getElementById("sheerClear").addEventListener("touchmove", start2);
});

const start2 = (event) => {
    console.log("1");
    document.getElementById("startPage").style.visibility = "hidden";
    document.getElementById("aSide").style.visibility = "hidden";
    document.getElementById("titlePuma").innerText = "מי אתה?";
    document.getElementById("titlePuma").classList.remove("titlePuma1");
    document.getElementById("titlePuma").classList.add("ExTitlePuma");
    document.getElementById("startPage2").style.visibility = "visible";
    document.getElementById("Driver").addEventListener("click", start);
    document.getElementById("Commander").addEventListener("click", start);
    document.getElementById("Gunner").addEventListener("click", start);
}
const start = (event) => {
    chosen = event.currentTarget.id;
    document.getElementById("titlePuma").innerText = "נמרה";
    document.getElementById("startPage2").style.visibility = "hidden";
    document.getElementById("aSide").classList.remove("aSide");
    document.getElementById("aSide").classList.add("aSideLittle");
    document.getElementById("sheerClear").removeEventListener("touchmove", start);
    document.getElementById("startPage").style.visibility = "hidden";
    document.getElementById("aSide").style.visibility = "hidden";
    document.getElementById("explantionPage").style.visibility = "visible";
    document.getElementById("titlePuma").classList.remove("titlePuma1");
    document.getElementById("titlePuma").classList.add("ExTitlePuma");
    document.getElementById("Month").addEventListener("click", tretmentPage);
    document.getElementById("Week").addEventListener("click", tretmentPage);
}
const tretmentPage = (event) => {
    type =event.currentTarget.id;
    console.log(type);
    document.getElementById("titlePuma").innerText = "שלבי טיפול";
    document.getElementById("explantionPage").style.display = "none";
    document.getElementById("treatmentpage").style.visibility = "visible";
    for (let i = 0; i < window[`arrSubject${chosen}${type}`].length; i++) {
    document.getElementById("itemList").innerHTML += `<div class="conteinerCheckBox" id="conteinerCheckBox"><span id="${i}" class="containerText">${window[`arrSubject${chosen}${type}`][i]}</span>
        <span class="checkmark" id="check-${i}">
            <div id="vi${i}"></div>
        </span>
      </div>`;
    }
    for (let j = 0; j < window[`arrSubject${chosen}${type}`].length; j++) {
        document.getElementById(`check-${j}`).addEventListener("click", () => {
            document.getElementById(`check-${j}`).classList.add("checkmark1");
            document.getElementById(`vi${j}`).classList.add("vi");
        });
        document.getElementById(j).addEventListener("click", () => {
            document.getElementById("aSide").style.visibility = "visible";
            document.getElementById("aSide").classList.add("aSideEnd");
            document.getElementById("aSide").classList.remove("aSideLittle");
            // if (-1 < j && j < 2) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[0]}`;
            // }
            // else if (1 < j && j < 9) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[1]}`;
            // }
            // else if (8 < j && j < 15) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[2]}`;
            //     document.getElementById("treatmentpageExTitle").classList.add("treatmentpageExTitleLong");
            // }
            // else if (14 < j && j < 19) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[3]}`;
            // }
            // else if (18 < j && j < 21) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[4]}`;
            // }
            // else if (20 < j && j < 22) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[5]}`;
            // }
            // else if (21 < j && j < 23) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[6]}`;
            // }
            // else if (22 < j && j < 25) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[7]}`;
            // }
            // else if (24 < j && j < 26) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[8]}`;
            // }
            // else if (25 < j && j < 27) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[9]}`;
            // }
            // else if (26 < j && j < 30) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[10]}`;
            //     if(j === 28){
            //         document.getElementById("treatmentpageEx").classList.remove("treatmentpageEx");
            //         document.getElementById("treatmentpageEx").classList.add("treatmentpageEx2");
            //         document.getElementById("next").style.visibility = "visible";
            //         document.getElementById("next").addEventListener("click", ()=>{
            //             document.getElementById("treatmentpageEx").innerHTML = arrExecutaionLong;
            //             document.getElementById("next").style.visibility = "hidden";
            //             document.getElementById("back").style.visibility = "visible";
            //             document.getElementById("back").addEventListener("click", ()=>{ 
            //                 document.getElementById("treatmentpageEx").innerHTML = `${window[`arrExecutaion${chosen}${type}`][28]}`;
            //                 document.getElementById("next").style.visibility = "visible";
            //                 document.getElementById("back").style.visibility = "hidden";
            //             });
            //         });
            //     }
            // }
            // else if (29 < j && j < 38) {
            //     document.getElementById("titlePuma").innerText = `${arrSection[11]}`;
            // }
            document.getElementById("playBtn").addEventListener("click", () => { 
                document.getElementById("play").style.visibility = "visible";
                document.getElementById("closeBut").addEventListener("click", () => { 
                    document.getElementById("play").style.visibility = "hidden";
                });
            });
            document.getElementById("treatmentpage").style.visibility = "hidden";
            document.getElementById("treatmentpageEx").style.visibility = "visible";
            // document.getElementById("treatmentpageExTitle").style.visibility = "visible";
            // document.getElementById("treatmentpageExTitle").innerHTML = `${window[`arrSubject${chosen}${type}`][j]}`;
            document.getElementById("treatmentpageEx").innerHTML = `${window[`arrExecutaion${chosen}${type}`][j]}`;
            document.getElementById("exBut").style.visibility = "visible";
            document.getElementById("playBtn").style.visibility = "visible";
            document.getElementById("exBut").addEventListener("click", goBack);
        });
    }
}

const goBack = () => {
    document.getElementById("aSide").style.visibility = "hidden";
    document.getElementById("aSide").classList.remove("aSideEnd");
    document.getElementById("aSide").classList.add("aSideLittle");
    document.getElementById("treatmentpage").style.visibility = "visible";
    document.getElementById("back").style.visibility = "hidden";
    document.getElementById("next").style.visibility = "hidden";
    // document.getElementById("treatmentpageExTitle").style.visibility = "hidden";
    document.getElementById("treatmentpageEx").style.visibility = "hidden";
    document.getElementById("exBut").style.visibility = "hidden";
    document.getElementById("playBtn").style.visibility = "hidden";
    document.getElementById("titlePuma").innerText = "שלבי טיפול";
    // document.getElementById("treatmentpageExTitle").classList.remove("treatmentpageExTitleLong");
    document.getElementById("treatmentpageEx").classList.remove("treatmentpageEx2");
    document.getElementById("treatmentpageEx").classList.add("treatmentpageEx");
}

const modelMove = (event) => {
    const modelViewer = document.getElementById("orbit-demo");
    const orbitCycle = [
        '45deg 55deg 4m',
        '-60deg 110deg 2m',
        modelViewer.cameraOrbit
    ];

    const currentOrbitIndex = orbitCycle.indexOf(modelViewer.cameraOrbit);
    modelViewer.cameraOrbit = orbitCycle[(currentOrbitIndex + 1) % orbitCycle.length];
}

